{
  "memories": [
    {
      "text": "I was born Dec 13, 1948. My earliest memory was when I was maybe 3-4 years old. It was a time when I slept in a crib. What I remember is a recurring dream that I had for what seemed like months. In the dream, I was in what I now recognize as being an oriental palace-like structure with ornate red and gold columns and a pool. I was being chased around the pool by a \"dragon.\" I didn't see the dragon in the dream, but I \"knew\" that's what was chasing me. This was a time before TV and we had no books or other material in which I could have seen those images, so I was always curious about how I obtained those oriental palace images. It was only later in life that I recognized those images as being oriental. And, as an added curiosity, I have always been attracted to the Orient. I've never had an interest in Europe/Western culture, only the Far East. So is there a connection between that earliest memory and my interests in later life?",
      "firstName": "Richard",
      "lastName": "Dickison",
      "category": "vse",
      "subcategory": "dream",
      "age": "3-4"
    },
    {
      "text": "I had a very early memory come back to me when I was in my thirties and it hit me like a freight train. I was sitting in my pram looking at my hands and started to focus on the scene unfolding in the background. I could see my nappies drying over the fire and then a plug socket with wires coming out of it. I started to reach for it when I heard my mother raise her voice and say ''Nooo.'' I became afraid and she calmed me down by giving me a snow dome with a small effigy of the Virgin Mary inside. I was fascinated by the snow falling gently on this little world. When this little scenario came back to me I was in a room with some friends and when I tried to explain to them that I had just remembered deep into my past they showed little or no interest and I can't say I blame them.",
      "firstName": "Peter",
      "lastName": "Dunne",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": ""
    },
    {
      "text": "We lived on a farm in what was Rhodesia until I was a week before my 3rd birthday, when we moved to the city, forevermore. I clearly remember the long straight dirt road leading to the house, and thinking that the other way might lead to heaven, or somewhere wonderful. I remember the morning milking of the cows, the smells, and the sound of the chatter, and I remember the cooked maize meal with chunks of beef and gravy, and its taste. These are all things I have never experienced since, so these memories must have been when I was still two, at the latest. But wonderful memories they are.",
      "firstName": "Ben",
      "lastName": "Alon",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": "2"
    },
    {
      "text": "Just after I turned 3, I remember walking through our new house, which was still being built - only finishing touches left. I have a very distinct memory of a man on a ladder out on the back porch painting the ceiling. I remember having to look past one of my parents to see him, but as my attention was outside, I don't know which one it was.",
      "firstName": "Robert",
      "lastName": "Armbruster",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": "3"
    },
    {
      "text": "I was about 4. For some reason my bed was next to a floor-to-ceiling mirror (I believe it might have been a closet door, \"classed up\" with a smoky-mirror effect). So I would wake up and the first thing I would see was -- me, staring back at me, through the rather cloudy mirror I was facing. And that is the earliest memory I have.",
      "firstName": "David",
      "lastName": "Berreby",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": "4"
    },
    {
      "text": "I remember being transfixed by the beauty of the clarity and light reflections on a long thread of a some pellucid material. My mother was a hazy presence in the room, off to my left, but not at my side. I was looking down at this amazing phenomenon. When it dawned on me that the lovely thread of light was my own drool, I had a nonverbal reaction that was, roughly, \"Eeeeeew! I HATE when I do that!\" I also remember a wriggling sensation.",
      "firstName": "Carla",
      "lastName": "Bolte",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": ""
    },
    {
      "text": "At age of three my parents brought us to our new home in Encinitas, CA to live in our home, now a heritage home shaped like a boat on shore, [...] The S.S. Moonlight. I recall walking down the center wooden hallway and noticing the filtered sunlight coming in from the porthole windows. http://encinitashistoricalsociety.org/The_Boathouses.html",
      "firstName": "Petra",
      "lastName": "Challus",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": "3"
    },
    {
      "text": "I was about 3 or 4. I'm almost 58 now. I distinctly remember...\"daddy long-legs\" spiders on a rock wall behind our house.",
      "firstName": "Mark",
      "lastName": "Dixon",
      "category": "vse",
      "subcategory": "outdoors",
      "age": "3-4"
    },
    {
      "text": "I can't pinpoint my exact age, but it could have been about the time of the attached picture. There was a shaded porch at the front of the house, with a narrow sidewalk leading to the back yard.... In fact, the exact sidewalk shown in the picture. It was a hot day, and I was barefoot... and as I stepped off the porch onto the unshaded sidewalk, I distinctly remember feeling a sensation of COLD on the soles of my feet. It must have been the first time I walked barefoot on a hot sidewalk. However, quickly realizing my mistake and recognizing the HOT sensation, I hopped back up on the shady porch.",
      "firstName": "Carl",
      "lastName": "Egetter",
      "category": "vse",
      "subcategory": "outdoors",
      "age": ""
    },
    {
      "text": "Earliest memory? Vivid experience of viewing the blue sky from my baby buggy while lying down. Memory seems to have me not just seeing the sky but feeling it—being it. Guessing I must have been around a year old or less.",
      "firstName": "Joan",
      "lastName": "Greenwald",
      "category": "vse",
      "subcategory": "",
      "age": "1"
    },
    {
      "text": "A toddler is grasping a small jam-jar\nContaining a cabbage-white butterfly,\nIn a warm and dusty summertime yard.\nThe fluttering wings puttering softly\nUp against the trap’s glass transparency.\nA man holds the memory like a bright\nSnapshot in his mind’s eye. Apparently\nThe infant is me, captured in sunlight.\nIn a moment the animal flaps free\nInto air. Red blood appears on an arm.\nA horrified woman runs up to see.\nI’m fingering a faint cross on my palm.\n\tA lifetime ago and a lifetime gone,\n\tNo lifetime remaining now but this one.",
      "firstName": "Ken",
      "lastName": "Hazelwood",
      "category": "vse",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "I think I remember toys above my crib latched onto the side. I know I remember riding the ferry from Newfoundland when I was about 18 months. It was unpleasant. We were on a bench on the deck and the ships horn was painfully loud.",
      "firstName": "Russ",
      "lastName": "Hoffman",
      "category": "vse",
      "subcategory": "travel",
      "age": "1"
    },
    {
      "text": "My first memory, aside from eating cherry Jello, I was possibly four, five months old, lying in my crib. I had never needed a night light as complete darkness has always been necessary for my sleep. I never suffered from monsters under my bed. My closet-- a different story. I learned quite by accident that I was able to entertain myself with the natural phosphenes induced by vigorously rubbing my eyes. Bright orange flashes, intense blues, pinwheels of colored dots, metamorphosing undulating organic apparitions, all beyond rational description (hey, I was only a baby!), each vaporizing with a lick of a sudden faint flame, to be replaced with the even more bizarre. My own self-induced mystical carnival of colors- a delightful natural spectacle, summoned at will for my very young goodnights' delight. * There are no pictures to submit as I was too young at the time to take selfies.",
      "firstName": "Rick",
      "lastName": "Lett",
      "category": "vse",
      "subcategory": "",
      "age": "0-1"
    },
    {
      "text": "I can remember squatting in the yard by the coal chute and looking at the Lilies of the Valley, how white they were against the black coal on the ground. The flowers seemed to be knee high, so I was very young. I also remember the tinkling sound I imagined they made. (Several years later I heard an orchestra playing over the loud exhaust of a car with a bad muffler as I road for forty minutes home with my father at night. A second very young memory is of sitting behind a coal/wood stove that was burning. My family was looking for me, but I liked the warm place between the stove and the wall.",
      "firstName": "Roger A.",
      "lastName": "Meyer",
      "category": "vse",
      "subcategory": "outdoors",
      "age": ""
    },
    {
      "text": "It was 1964, and I was three years old living in Guam. I remember sitting on the white sand beach just at the water's edge, playing with a bucket. The water was very clear, and I could see the sea shells under water. I was wearing a red bathing suit with a little skirt. Afterwards, we went to a concessions stand where I had a chocolate milkshake. It really was paradise.",
      "firstName": "Marianne",
      "lastName": "Mortera",
      "category": "vse",
      "subcategory": "outdoors",
      "age": "3"
    },
    {
      "text": "Someone was holding me in their arms near the old black cookstove. When another person lifted up one of the round iron covers, I could peer down into the stove and see the fire burning, bright yellow-orange and dramatic through the black hole. Mother said I must have been 1 1/2.",
      "firstName": "Joan",
      "lastName": "Pasch",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": "1"
    },
    {
      "text": "I was born on January 18, 1944 in Bradenton, Florida, a small town on the Gulf of Mexico. When, I was about 2 or 3 years old, I remember lying near a window in the bedroom of our two bedroom house, looking out the window at the oranges on the trees next to the window.",
      "firstName": "Joseph",
      "lastName": "Reed",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": "2-3"
    },
    {
      "text": "Just before my third birthday we flew from Southern California to Kansas City. Up to then I had mostly only seen a brown, dry landscape - this was the late 1940's before irrigated lawns. As the plane was landing I was looking out the window and was amazed by the bright green grass covered all over with yellow flowers (Dandelions).",
      "firstName": "Lois",
      "lastName": "Ruble",
      "category": "vse",
      "subcategory": "travel",
      "age": "2"
    },
    {
      "text": "I remember being in a crib (I promise) in a darkened room in the afternoon (probably for a nap). I remember a curtained window in the room and a soft plaid blanket mostly white. My mother said that this was in Trenton, N.J. and I was about 18 months of age.",
      "firstName": "Richard A.",
      "lastName": "Schultz",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": "1"
    },
    {
      "text": "There is a memory of my childhood which occasionally resurfaces from the deepest depths of my mind, which I feel must be from my first year of life--possibly around ten months old. The large front window of our house was divided into upper and lower sections by a wooden beam (or sill), and I was barely tall enough to reach up and hold onto the sill so I could support myself while peering outside, just over the top of the sill, at our front patio, lawn and driveway. I can remember watching the mailman as he crossed the front patio to place the day's mail in the mailbox at our front door. And in my mind's eye, I can also see an old photograph from our family photo album showing me from behind, wearing only a diaper, looking out the front window as I have described. (Though, no such photograph actually exists today, in the album I inherited after my mother's death. So, who knows whether or not I simply imagined seeing such a photo of me as a child?)",
      "firstName": "",
      "lastName": "",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": "0-1"
    },
    {
      "text": "In my earliest memory, I believe I was about 15 months old. It is Christmas time, and I can visualize a Christmas tree beside a bay window; I am sitting and crawling on the floor around the tree, and I am playing with a red plastic toy. My parents told me that I was late in starting to walk – nearly two years old, I think, so by my second birthday I would have been walking. So this must have been the previous Christmas, when I would have been nearly 15 months.",
      "firstName": "Peter",
      "lastName": "Ramsden",
      "category": "vse",
      "subcategory": "holiday",
      "age": "1"
    },
    {
      "text": "I recall as a two year old the first basement apartment, one bedroom my parents and I lived in. At Christmas time that year I received a small electric pin ball machine with ball catches that lit up. Two weeks later I turned 3. A year later the family moved to a new house.",
      "firstName": "F.",
      "lastName": "Vonsnickle",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": "2"
    },
    {
      "text": "I have several memories from the time I was 18-20 months old. One consisted of hearing a parade go down our street, which we then watched from the porch of our house in Whittier, CA.",
      "firstName": "Jeffrey",
      "lastName": "Jones",
      "category": "vse",
      "subcategory": "outdoors",
      "age": "1"
    },
    {
      "text": "I remember being close to three years old. The house next door burned to the ground on Christmas Eve. I remember the sounds of the fire engines, people running everywhere.",
      "firstName": "Carolyn",
      "lastName": "Lawler",
      "category": "vse",
      "subcategory": "",
      "age": "3"
    },
    {
      "text": "I was under a year old but already talking in sentences. I remember being on the porch of our two-story apartment building, in my play pen. People would come by and I remember that I would ask them something my mother always said to visitors, \"Come on in for a cup of coffee!\"",
      "firstName": "Deborah",
      "lastName": "Koreneff",
      "category": "vse",
      "subcategory": "",
      "age": "0-1"
    },
    {
      "text": "I was three and I was watching a yellow bulldozer move earth and said to my friend, \"I want to do that!\" It was at my parents' Glendora House.",
      "firstName": "Kurt",
      "lastName": "Cooper",
      "category": "vse",
      "subcategory": "outdoors",
      "age": "3"
    },
    {
      "text": "My earliest memory is pretty mundane. In it, I am talking a walk around the block (near my house, I think), and I remember noticing how the beat of my footfalls on the sidewalk made a song. This worries me greatly, because I'm afraid my parents will hear it, and that I'll be embarrassed. Given the location, I must have been 2 or barely 3.",
      "firstName": "Emily",
      "lastName": "Stahl",
      "category": "vse",
      "subcategory": "outdoors",
      "age": "2"
    },
    {
      "text": "I remember several events and activities very vividly...between age two and three. Playing in the garden in front of my house with my mother and talking about the colors of the flowers. Catching butterflies and setting them free in my room and watching them fly out through the window.",
      "firstName": "Neelakantan",
      "lastName": "Sunder",
      "category": "vse",
      "subcategory": "outdoors",
      "age": "2-3"
    },
    {
      "text": "I remember eating ice cubes outside, playing in a hedge, I must have been about 18 months old, I remember dad going to work, [...] I remember the area and various other things around that area and time. If any of this is of interest let me know.",
      "firstName": "Christopher",
      "lastName": "Wesselingh",
      "category": "vse",
      "subcategory": "outdoors",
      "age": "1"
    },
    {
      "text": "I was given a puppy for my 3rd birthday. He was born 8 weeks before my birthday, so this memory must have been near my birthday. I remember the farm house and walking around to the backyard where the mother and puppies were being kept in a pen attached to the house. The house was a pink/coral color. I can see the dogs in the pen and feel the joy of picking my Mittens.",
      "firstName": "Emily",
      "lastName": "Andersen",
      "category": "vse",
      "subcategory": "outdoors",
      "age": "3"
    },
    {
      "text": "My earliest memory is of being taken up for a joy flight on my father's knee with Sir Alan Cobham's Flying Circus in Northern England. It was April 1930 and I had just turned 3. It was a byplane with two open cockpits. I hope there was a seatbelt, but I don't rememember it. Cobham, a land-speed record holder, was, like many others at the time, trying to popularise flying.",
      "firstName": "Jeff",
      "lastName": "Whittle",
      "category": "vse",
      "subcategory": "",
      "age": "3"
    },
    {
      "text": "I was probably between 2-3 years old. My mother was a medical resident in training, rarely home, and I remember a feeling of wanting to be with her. Here is the memory: I walked to the right side of the bed where she lay – I woke her by asking her for juice. She got up and walked with me to the kitchen (left of the bedroom). I never drank the orange juice. It was in a clear glass placed on the wooden dresser to the right of the bed. In the morning, there was large cockroach – drowned in the juice.",
      "firstName": "Dena",
      "lastName": "Dubal",
      "category": "vse",
      "subcategory": "",
      "age": "2-3"
    },
    {
      "text": "I was in-between fourteen and eighteen months (according to my mother) when I saw the Tomb of the Unknown Soldier. It was a sunny day and I was with my mother and my father. My father was holding me and I remember the vantage point. I was higher up than other things I remember from when I was very young.",
      "firstName": "Beth",
      "lastName": "Gibson",
      "category": "vse",
      "subcategory": "travel",
      "age": "1"
    },
    {
      "text": "My earliest childhood memory was in the home I grew up in, I was standing holding on to my crib crying for my mother. I could see the back of her head, and she was ignoring me. I remember being very angry and screaming. I remember I did not know how to form words, so I screamed. When she would not turn or come to me, I decided to climb out of my crib. As soon as I breached the top rail, I slipped over and fell to the floor. Of course baby's heads are the heaviest part of their bodies, so that is where I landed. The next thing I knew, my mother was running to me and grabbing me up from the floor. I remember as she rocked me against her shoulder she was crying. My oldest brother came behind her to look at me. I remember the shock in his eyes when he saw me. He told me when I was 10 years older, that he saw an egg size lump swelling from my forehead. I also remember, being in the car and reaching towards the window and crying… My mind does not link these two situations together, but was told on the way to the hospital after the fall in the panic my hand was closed in the car door. I suppose I remember because for a baby it must have been quite traumatic!",
      "firstName": "D.",
      "lastName": "Ebi",
      "category": "trouble",
      "subcategory": "fear",
      "age": ""
    },
    {
      "text": "Age, according to Wolfram Alpha, I was 2 years 3 months 15 days. I fell head first into what I thought of as a river. Mom says it was a stream. I remember seeing the silt in the water in layers. My uncle pulled me out as his legs were longer and faster. I don't remember that. It is my understanding that if one experiences some sort of trauma in early childhood, one will remember that. That must be the case here because even today, I have minor issues putting my head underwater.",
      "firstName": "David",
      "lastName": "Eckard",
      "category": "trouble",
      "subcategory": "",
      "age": "2"
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    }
  ]
}