{
  "memories": [
    {
      "text": "I was born Dec 13, 1948. My earliest memory was when I was maybe 3-4 years old. It was a time when I slept in a crib. What I remember is a recurring dream that I had for what seemed like months. In the dream, I was in what I now recognize as being an oriental palace-like structure with ornate red and gold columns and a pool. I was being chased around the pool by a \"dragon.\" I didn't see the dragon in the dream, but I \"knew\" that's what was chasing me. This was a time before TV and we had no books or other material in which I could have seen those images, so I was always curious about how I obtained those oriental palace images. It was only later in life that I recognized those images as being oriental. And, as an added curiosity, I have always been attracted to the Orient. I've never had an interest in Europe/Western culture, only the Far East. So is there a connection between that earliest memory and my interests in later life?",
      "firstName": "Richard",
      "lastName": "Dickison",
      "category": "vse",
      "subcategory": "dream",
      "age": "3-4"
    },
    {
      "text": "I had a very early memory come back to me when I was in my thirties and it hit me like a freight train. I was sitting in my pram looking at my hands and started to focus on the scene unfolding in the background. I could see my nappies drying over the fire and then a plug socket with wires coming out of it. I started to reach for it when I heard my mother raise her voice and say ''Nooo.'' I became afraid and she calmed me down by giving me a snow dome with a small effigy of the Virgin Mary inside. I was fascinated by the snow falling gently on this little world. When this little scenario came back to me I was in a room with some friends and when I tried to explain to them that I had just remembered deep into my past they showed little or no interest and I can't say I blame them.",
      "firstName": "Peter",
      "lastName": "Dunne",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": ""
    },
    {
      "text": "We lived on a farm in what was Rhodesia until I was a week before my 3rd birthday, when we moved to the city, forevermore. I clearly remember the long straight dirt road leading to the house, and thinking that the other way might lead to heaven, or somewhere wonderful. I remember the morning milking of the cows, the smells, and the sound of the chatter, and I remember the cooked maize meal with chunks of beef and gravy, and its taste. These are all things I have never experienced since, so these memories must have been when I was still two, at the latest. But wonderful memories they are.",
      "firstName": "Ben",
      "lastName": "Alon",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": "2"
    },
    {
      "text": "Just after I turned 3, I remember walking through our new house, which was still being built - only finishing touches left.  I have a very distinct memory of a man on a ladder out on the back porch painting the ceiling.  I remember having to look past one of my parents to see him, but as my attention was outside, I don't know which one it was.",
      "firstName": "Robert",
      "lastName": "Armbruster",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": "3"
    },
    {
      "text": "I was about 4. For some reason my bed was next to a floor-to-ceiling mirror (I believe it might have been a closet door, \"classed up\" with a smoky-mirror effect). So I would wake up and the first thing I would see was -- me, staring back at me, through the rather cloudy mirror I was facing. And that is the earliest memory I have.",
      "firstName": "David",
      "lastName": "Berreby",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": "4"
    },
    {
      "text": "I remember being transfixed by the beauty of the clarity and light reflections on a long thread of a some pellucid material. My mother was a hazy presence in the room, off to my left, but not at my side. I was looking down at this amazing phenomenon. When it dawned on me that the lovely thread of light was my own drool, I had a nonverbal reaction that was, roughly, \"Eeeeeew! I HATE when I do that!\" I also remember a wriggling sensation.",
      "firstName": "Carla",
      "lastName": "Bolte",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": ""
    },
    {
      "text": "At age of three my parents brought us to our new home in Encinitas, CA to live in our home, now a heritage home shaped like a boat on shore, [...] The S.S. Moonlight. I recall walking down the center wooden hallway and noticing the filtered sunlight coming in from the porthole windows. http://encinitashistoricalsociety.org/The_Boathouses.html",
      "firstName": "Petra",
      "lastName": "Challus",
      "category": "vse",
      "subcategory": "roomfurn",
      "age": "3"
    },
    {
      "text": "I was about 3 or 4. I'm almost 58 now. I distinctly remember...\"daddy long-legs\" spiders on a rock wall behind our house.",
      "firstName": "Mark",
      "lastName": "Dixon",
      "category": "vse",
      "subcategory": "outdoors",
      "age": "3-4"
    },
    {
      "text": "I can't pinpoint my exact age, but it could have been about the time of the attached picture. There was a shaded porch at the front of the house, with a narrow sidewalk leading to the back yard.... In fact, the exact sidewalk shown in the picture. It was a hot day, and I was barefoot... and as I stepped off the porch onto the unshaded sidewalk, I distinctly remember feeling a sensation of COLD on the soles of my feet. It must have been the first time I walked barefoot on a hot sidewalk. However, quickly realizing my mistake and recognizing the HOT sensation, I hopped back up on the shady porch.",
      "firstName": "Carl",
      "lastName": "Egetter",
      "category": "vse",
      "subcategory": "outdoors",
      "age": ""
    },
    {
      "text": "Earliest memory? Vivid experience of viewing the blue sky from my baby buggy while lying down. Memory seems to have me not just seeing the sky but feeling it—being it. Guessing I must have been around a year old or less.",
      "firstName": "Joan",
      "lastName": "Greenwald",
      "category": "vse",
      "subcategory": "",
      "age": "1"
    },
    {
      "text": "A toddler is grasping a small jam-jar\nContaining a cabbage-white butterfly,\nIn a warm and dusty summertime yard.\nThe fluttering wings puttering softly\nUp against the trap’s glass transparency.\nA man holds the memory like a bright\nSnapshot in his mind’s eye. Apparently\nThe infant is me, captured in sunlight.\nIn a moment the animal flaps free\nInto air. Red blood appears on an arm.\nA horrified woman runs up to see.\nI’m fingering a faint cross on my palm.\n\tA lifetime ago and a lifetime gone,\n\tNo lifetime remaining now but this one.",
      "firstName": "Ken",
      "lastName": "Hazelwood",
      "category": "vse",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    },
    {
      "text": "",
      "firstName": "",
      "lastName": "",
      "category": "",
      "subcategory": "",
      "age": ""
    }
  ]
}